CREATE TABLE
    question (
        id SERIAL PRIMARY KEY NOT NULL,
        title VARCHAR NOT NULL,
        answer JSON NOT NULL,
        score JSON NOT NULL
    );

INSERT INTO
    question (title, answer, score)
VALUES (
        '你更喜欢吃那种水果',
        '{
	"A": "草莓",
	"B": "苹果",
	"C": "西瓜",
	"D": "菠萝",
	"E": "橘子"
}',
        '{
	"A": 2,
	"B": 3,
	"C": 5,
	"D": 10,
	"E": 15
}'
    ), (
        '你平时休闲经常去的地方',
        '{
	"A": "郊外",
	"B": "电影院",
	"C": "公园",
	"D": "商场",
	"E": "酒吧",
    "F": "练歌房"
}',
        '{
	"A": 2,
	"B": 3,
	"C": 5,
	"D": 10,
	"E": 15,
    "F": 20
}'
    ), (
        '你认为容易吸引你的人是',
        '{
	"A": "有才气的人",
	"B": "依赖你的人",
	"C": "优雅的人",
	"D": "善良的人",
	"E": "性情豪放的人"
}',
        '{
	"A": 2,
	"B": 3,
	"C": 5,
	"D": 10,
	"E": 15 
}'
    ), (
        '如果你可以成为一种动物，你希望自己是哪种',
        '{
	"A": "猫",
	"B": "马",
	"C": "大象",
	"D": "猴子",
	"E": "狗",
    "F": "狮子"
}',
        '{
	"A": 2,
	"B": 3,
	"C": 5,
	"D": 10,
	"E": 15,
    "F": 20
}'
    ), (
        '天气很热，你更愿意选择什么方式解暑',
        '{
	"A": "游泳",
	"B": "喝冷饮",
	"C": "开空调"
}',
        '{
	"A": 5,
	"B": 10,
	"C": 15
}'
    ), (
        '如果必须与一个你讨厌的动物或昆虫在一起生活，你能容忍哪一个',
        '{
	"A": "蛇",
	"B": "猪",
	"C": "老鼠",
	"D": "苍蝇"
}',
        '{
	"A": 2,
	"B": 5,
	"C": 10,
	"D": 15
}'
    ), (
        '你喜欢看哪类电影、电视剧',
        '{
	"A": "悬疑推理类",
	"B": "童话神话类",
	"C": "自然科学类",
	"D": "伦理道德类",
	"E": "战争枪战类"
}',
        '{
	"A": 2,
	"B": 3,
	"C": 5,
	"D": 10,
	"E": 15
}'
    ), (
        '以下哪个是你身边必带的物品',
        '{
	"A": "打火机",
	"B": "口红",
	"C": "记事本",
	"D": "纸巾",
	"E": "手机"
}',
        '{
	"A": 2,
	"B": 2,
	"C": 3,
	"D": 5,
	"E": 10
}'
    ), (
        '你出行时喜欢坐什么交通工具',
        '{
	"A": "火车",
	"B": "自行车",
	"C": "汽车",
	"D": "飞机",
	"E": "步行"
}',
        '{
	"A": 2,
	"B": 3,
	"C": 5,
	"D": 10,
	"E": 15
}'
    ), (
        '以下颜色你更喜欢哪种',
        '{
	"A": "紫",
	"B": "黑",
	"C": "蓝",
	"D": "白",
	"E": "黄",
    "F": "红"
}',
        '{
	"A": 2,
	"B": 3,
	"C": 5,
	"D": 8,
	"E": 12,
    "F": 15
}'
    ), (
        '下列运动中挑选一个你最喜欢的（不一定擅长）',
        '{
	"A": "瑜珈",
	"B": "自行车",
	"C": "乒乓球",
	"D": "拳击",
	"E": "足球",
    "F": "蹦极"
}',
        '{
	"A": 2,
	"B": 3,
	"C": 5,
	"D": 8,
	"E": 10,
    "F": 15
}'
    ), (
        '如果你拥有一座别墅，你认为它应当建立在哪里',
        '{
	"A": "湖边",
	"B": "草原",
	"C": "海边",
	"D": "森林",
	"E": "城中区"
}',
        '{
	"A": 2,
	"B": 3,
	"C": 5,
	"D": 10,
	"E": 15
}'
    ), (
        '你更喜欢以下哪种天气现象',
        '{
	"A": "雪",
	"B": "风",
	"C": "雨",
	"D": "雾",
	"E": "雷电"
}',
        '{
	"A": 2,
	"B": 3,
	"C": 5,
	"D": 10,
	"E": 15
}'
    ), (
        '你希望自己的窗口在一座30层大楼的第几层',
        '{
	"A": "七层",
	"B": "一层",
	"C": "二十三层",
	"D": "十八层",
	"E": "三十层"
}',
        '{
	"A": 2,
	"B": 3,
	"C": 5,
	"D": 10,
	"E": 15
}'
    ), (
        '你认为自己更喜欢在以下哪一个城市中生活',
        '{
	"A": "丽江",
	"B": "拉萨",
	"C": "昆明",
	"D": "西安",
	"E": "杭州",
    "F": "北京"
}',
        '{
	"A": 1,
	"B": 3,
	"C": 5,
	"D": 8,
	"E": 10,
    "F": 15
}'
    );